Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_Framework_Swift/Framework_Swift-level2_source2.tmx
Source language: en_us
Languages: ja

source: The collection traversal modeled by children is captured so that the resulting mirror’s children may be upgraded to a bidirectional or random access collection later.
ja: childrenによる走査型のコレクションはキャプチャされます、それで結果となるミラーのもつ子らは、双方向または無作為アクセスのコレクションに後でアップグレードできます。

source: The collection traversal modeled by unlabeledChildren is captured so that the resulting mirror’s children may be upgraded to a bidirectional or random access collection later.
ja: unlabeledChildrenによる走査型のコレクションはキャプチャされます、それで結果となるミラーのもつ子らは、双方向または無作為アクセスのコレクションに後でアップグレードできます。

source: The collection’s “past the end” position—that is, the position one greater than the last valid subscript argument.
ja: コレクションの「終わりを過ぎた」位置—すなわち、最後の有効な添え字引数より１つ大きい位置。

source: The comparison returns true if both arguments are nil or if the two arguments wrap values that are equal.
ja: この比較がtrueを返すのは、両方の引数がnilである場合か、２つの引数が同等な値らをラップする場合です。

source: The components used for hashing must be the same as the components compared in your type’s == operator implementation.
ja: ハッシュ化に使用される構成要素は、あなたの型のもつ==演算子実装において比較される構成要素と同じでなければなりません。

source: The compositing operation of the fill defaults to the context’s compositing operation, not necessarily using NSCompositingOperation.copy like NSRectFill(_:) does.
ja: 塗りつぶしの合成演算は、初期状態ではその文脈のもつ合成演算になります、必ずしもNSRectFill(_:)がするようにNSCompositingOperation.copyを使いません。

source: The compositing operation to use when filling the rects.
ja: 矩形それらを塗りつぶす時に使う合成演算。

source: The container to hold.
ja: 収容するためのコンテナ。

source: The contiguous memory footprint of T, in bytes.
ja: Tの隣接メモリフットプリント、バイトで。

source: The conversion of p to a string in the assignment to s uses the Point type’s debugDescription property.
ja: pの文字列への変換はsへの代入において、Point型のもつdebugDescriptionプロパティを使います。

source: The conversion of p to a string in the assignment to s uses the Point type’s description property.
ja: sへの代入におけるpの文字列への変換は、Point型のもつdescriptionプロパティを使います。

source: The correct placement of the call to closeFile() is outside of the closure:
ja: closeFile()への呼び出しの正しい配置は、クロージャの外側です：

source: The corresponding value of the raw type.
ja: この生の型の対応している値。

source: The custom mirror for this instance.
ja: このインスタンスのためのあつらえのミラー。

source: The decoder to read data from.
ja: それからデータを読み出すデコーダ。

source: The default implementation returns 0.
ja: 省略時の実装は、０を返します。

source: The default is 10.
ja: 省略時は10。

source: The default is nil.
ja: 省略時にはnilです。

source: The default is false.
ja: 初期状態はfalseです。

source: The default is .generated.
ja: 省略時は.generatedです。

source: The default memory alignment of T, in bytes.
ja: Tの省略時のメモリアライメント、バイトで。

source: The default memory alignment, in bytes, of the given value’s type.
ja: 与えられた値の型の、バイトでの、省略時のメモリアライメント。

source: The default separator is an empty string.
ja: 省略時の分離子は空の文字列です。

source: The default type for an otherwise-unconstrained Boolean literal.
ja: ブールリテラルである他は別途制約されない省略時用の型。

source: The default type for an otherwise-unconstrained floating-point literal.
ja: 別途制約されない浮動小数点リテラルのための省略時型。

source: The default type for an otherwise-unconstrained integer literal.
ja: 別途制約されない整数リテラルのための省略時型。

source: The default value is false.
ja: 省略時の値はfalseです。

source: The default value is Int.max.
ja: 省略時の値はInt.maxです。

source: The default value is true.
ja: 省略時の値は、trueです。

source: The descendant of this mirror specified by the given mirror path components if such a descendant exists; otherwise, nil.
ja: 与えられたミラーパス構成要素によって指定されるこのミラーの子孫、もしそのような子孫が存在するならば；そうでなければ、nil。

source: The description property of a conforming type must be a value-preserving representation of the original value.
ja: 準拠する型の説明プロパティは、元の値の値保全表現でなければなりません。

source: The difference between these states can be distinguished with a contains(_:) call.
ja: これらの状態の相違は、contains(_:)呼び出しで見分けることが可能です。

source: The difference needed to produce the receiver’s state from the parameter’s state.
ja: レシーバのもつ状態をパラメータのもつ状態から生成するのに必要とされる差異。

source: The difference needed to produce this collection’s ordered elements from the given collection.
ja: このコレクションのもつ順番付けられた要素をこの与えられたコレクションから生成するのに必要とされる差異。

source: The difference of the two arguments must be representable in the arguments’ type.
ja: ２つの引数の差は、引数の持つ型において表現可能でなければなりません。

source: The difference to be applied.
ja: 適用されることになる差異。

source: The distance between start and end.
ja: startとendの隔たり。

source: The distance from this value to other.
ja: この値からotherまでの隔たり。

source: The distance to advance this value.
ja: この値を前進させる距離。

source: The distance to offset i.
ja: iを補う間隔。

source: The efficiency of finding each element in the argument list depends on the argument type and the capabilities of the each level of the mirror’s children collections.
ja: 各要素を引数リストにおいて見つけることの効率は、引数型と、ミラーのもつchildrenコレクションそれらの各水準の能力に依存します。

source: The element at the position created using ReversedIndexIndex) is "r", the character before "a" in the name string.
ja: ReversedIndexIndex)を使って作成された位置での要素は、"r"、name文字列の中の"a"の前の文字です。

source: The element of the set to remove.
ja: 削除されることになる集合の要素。

source: The element that should be split upon.
ja: それで分離されることになる要素。

source: The element that was removed from the set.
ja: この集合から削除された要素。

source: The element to append to the collection.
ja: この要素をコレクションへ追加します。

source: The element to check for containment.
ja: この要素が含まれるかを調べます。

source: The element to find in the sequence.
ja: このシーケンスにおいて見つける要素。

source: The element to insert.
ja: 挿入される要素。

source: The element to look for in the option set.
ja: オプションセットにおいて捜される要素。

source: The element to remove from the set.
ja: この集合から削除されることになる要素。

source: The element to repeat.
ja: 繰り返される要素。

source: The element type of a KeyValuePairs: a tuple containing an individual key-value pair.
ja: KeyValuePairsの要素型：個々のキー値ペアを含んでいるタプル。

source: The element type of the option set.
ja: オプションセットの要素型。

source: The elements of a partial range are the consecutive values from its lower bound continuing upward indefinitely.
ja: 部分範囲の要素は、それの下側の境界から無限に上方に続いている隣接範囲です。

source: The elements of the index vector are wrapped modulo the count of elements in this vector.
ja: インデックスベクターの要素は、このベクターの中の要素の数によるモジュロでラップされます。

source: The elements of the range are the consecutive values from its lower bound up to, but not including, its upper bound.
ja: 範囲の要素は、それの下側の境界から、それの上側の境界までしかしそれを含まない、隣接値です。

source: The elements of the result are computed lazily, each time they are read, by calling transform function on a base element.
ja: 結果のそれぞれの要素は遅延に計算されます、毎回それらは、基盤となる要素上でtransform関数を呼び出すことによって読み出されます。

source: The elements of the result are computed on-demand, as the result is used.
ja: 結果の要素は、要求に応じて、結果が使われるときに計算されます。

source: The elements of the resulting array are ordered according to the given predicate.
ja: 結果の配列の要素は、与えられた述部にしたがって並べられます。

source: The elements to append to the collection.
ja: これらの要素をコレクションへ追加します。

source: The elements to use as members of the new set.
ja: 新しい集合の要素として使うための要素。

source: The elements to use in the vector.
ja: このベクターにおいて使うことになる要素。

source: The encoder to write data to.
ja: データを書き込むエンコーダ。

source: The end index refers to the position one past the last element of a collection, so it doesn’t correspond with an element.
ja: 末尾インデックスは、あるコレクションの最後の要素を１つ過ぎた位置を参照します、それでそれはある要素に対応しません。

source: The enumeration has any private cases
ja: 列挙が何らかのプライベートなケース節を持つならば

source: The example below adds another favorite color:
ja: 下の例は、別のお気に入りの色を加えます：

source: The example below adds the NS_REFINED_FOR_SWIFT macro to the getRed(red:green:blue:alpha:) method:
ja: 下の例は、NS_REFINED_FOR_SWIFTマクロをgetRed(red:green:blue:alpha:)メソッドに加えます：

source: The example below creates a FileHandle and an array of data lines to write to the file that the handle refers to:
ja: 下の例は、FileHandleと、データ行からなる配列を作成して、そのハンドルが参照するファイルに書き出します：

source: The example below defines a Lottery enumeration that randomly picks a winning number and calls a completion handler if the right number is guessed:
ja: 下の例は、Lottery列挙を定義します、それはランダムに当選番号を選んで、正しい数が推測されるならば完了ハンドラを呼び出します。

source: The example below defines two functions, now(_:) and later(_:).
ja: 下の例は、２つの関数、now(_:)とlater(_:)を定義します。

source: The example below renames a class and one of its properties:
ja: 下の例は、クラスとそれのプロパティの１つを改名します。

source: The example below shows an Objective-C API that can be expressed more succinctly once it's imported into Swift:
ja: 下の例は、あるObjective-C APIを示します、それはいったんそれがSwiftにインポートされるならばより簡潔に表現可能なものです：

source: The example below shows how to apply the NS_OPTIONS macro and assign raw values that are mutually exclusive:
ja: 下の例は、NS_OPTIONSマクロを適用する、そして互いに排他的である生の値を割り当てる方法を示します：

source: The example below shows several functions that are all related to a Color type.
ja: 下の例は、すべてColor型に関係するいくつかの関数を示します。

source: The example below uses the NS_TYPED_ENUM macro to declare the different colors used by a traffic light:
ja: 下の例は、NS_TYPED_ENUMマクロを使って、信号機によって使われる異なる色を宣言します：

source: The example below uses the macro to declare a UITableViewCellStyle enumeration that groups several different view styles for table views:
ja: 下の例は、このマクロを使って、UITableViewCellStyle列挙を宣言します、それはテーブルビューに対する幾つかの異なるビュースタイルをグループにまとめます：

source: The examples below show how a FavoriteColor type is declared, imported, and extended.
ja: 下の例は、FavoriteColor型が宣言、インポート、そして拡張される方法を示します。

source: The existing API is renamed with double underscores (__) when it's imported, to help prevent you from accidentally using the existing API elsewhere.
ja: 既存のAPIは、それがインポートされる時に二重アンダースコア（__）で改名され、あなたが誤って既存のAPIをどこか他で使うことを防ぐ助けとなります。

source: The explicit permission to implement operations lazily applies only in contexts where the sequence is statically known to conform to LazySequenceProtocol.
ja: 遅延に演算を実施するための明示的な許可は、そこにおいてシーケンスがLazySequenceProtocolに準拠することを静的に見分けられる文脈においてのみ適用されます。

source: The failure to send when terminating.
ja: 終了する時に送られることになる失敗。

source: The fill operation uses the deviceGray color space.
ja: 塗りつぶし演算は、deviceGray色空間を使います。

source: The final accumulated value.
ja: 最終的に蓄積された値。

source: The final example passes false for the omittingEmptySubsequences parameter, so the returned array contains empty strings where spaces were repeated.
ja: 最後の例はfalseをomittingEmptySubsequencesパラメータに渡します、なので返される配列は空白が繰り返されたところで空の文字列を含みます。

source: The final example passes true for the allowEmptySlices parameter, so the returned array contains empty strings where spaces were repeated.
ja: 最後の例はtrueをallowEmptySlicesパラメータに渡します、なので返される配列は空白が繰り返されたところで空の文字列を含みます。

source: The first element of the collection if the collection is not empty; otherwise, nil.
ja: コレクションが空でないならばコレクションの最初の要素；そうでなければnil。

source: The first element of the collection.
ja: コレクションの最初の要素。

source: The first element of the sequence that satisfies predicate, or nil if there is no element that satisfies predicate.
ja: predicate満たすシーケンスの最初の要素、またはpredicateを満たす要素が無いならばnil。

source: The first element of the vector.
ja: ベクターの最初の要素。

source: The first index where element is found.
ja: elementが見つけられたところの最初のインデックス。

source: The first mirror path component to access.
ja: アクセスすることになる最初のミラーパス構成要素。

source: The first one declares the FavoriteColor type and adds a single enumeration case for the color blue:
ja: 最初のものは、FavoriteColor型を宣言して、単一の列挙ケース節を青色に対して加えます：

source: The first partition, numbers[..<p], is made up of the elements that are not greater than 30.
ja: 最初の区画、numbers[..<p]は、30より大きくない要素から構成されます。

source: The first use of split returns each word that was originally separated by one or more spaces.
ja: splitの最初の利用は、各単語を返します、それはもともと１つ以上の空白で隔てられています。

source: The first value to add.
ja: 加算する第１の値。

source: The first value to multiply.
ja: 掛け合わされる第１の値。

source: The following code shows the MyList type after annotation.
ja: 以下のコードは、注釈の後のMyList型を示します。

source: The following code uses this method to test whether all the names in an array have at least five characters:
ja: 以下のコードは、このメソッドを使って、配列の中の全ての名前が少なくとも５つの文字を含むかどうかを試験します：

source: The following example accesses an element of an array through its subscript to print its value:
ja: 以下の例は、配列のある要素にそれの添え字によってアクセスしてそれの値を出力します。

source: The following example adds a new number to an array of integers:
ja: 次の例は、ある新しい要素を整数からなる配列へ加えます：

source: The following example appends the elements of a Range<Int> instance to an array of integers:
ja: 次の例は、Range<Int>インスタンスからなるいくらかの要素を整数からなる配列に追加します：

source: The following example creates a collection containing the name “Humperdinck” repeated five times:
ja: 以下の例は、５回繰り返した名前「Humperdinck」を含んでいるコレクションを作成します：

source: The following example creates a new ReversedIndex from the index of the "a" character in a string’s character view.
ja: 以下の例は、新しいReversedIndexを、文字列の文字ビューの中の"a"文字のインデックスから作成します。

source: The following example creates a user-readable list from an array of integers by providing a member style format, list width, and list type:
ja: 以下の例は、ユーザに読みやすいリストを整数いくつかからなるある配列から項目形式書式、リスト幅、そしてリスト型を提供することによって作成します：

source: The following example creates an array initialized with five strings containing the letter Z.
ja: 以下の例は、字Zを含んでいる５つの文字列で初期化される配列を作成します。

source: The following example creates an example class IntegerRef and compares instances of the class using their object identifiers and the identical-to operator (===):
ja: 次の例は、ある見本クラスIntegerRefを作成して、そのクラスのインスタンスをそれらのオブジェクト識別子と同一演算子（===）を使って比較します：

source: The following example declares a Point type with x and y coordinates and a Boolean isFilled property.
ja: 以下の例は、Point型をxおよびy座標、そしてブールのisFilledプロパティで宣言します。

source: The following example declares a function that returns the index of the last even number in the passed array, if one is found.
ja: 以下の例は、ある関数を宣言します、それは渡された配列の中の最後の偶数のインデックスを返します、それが見つけられるならば。

source: The following example defines x as an instance of UInt8, an 8-bit, unsigned integer type.
ja: 以下の例は、xをUInt8のインスタンス、ある８ビットの、符号なし整数型として定義します。

source: The following example extends Sequence with a method that returns an array with the sequence’s values multiplied by two.
ja: 以下の例は、Sequenceをあるメソッドで拡張します、それはそのシーケンスの２を掛けた値を持つ配列を返すものです。

source: The following example introduces an API that generates random numbers, but that fails approximately half of the time.
ja: 以下の例は、無作為な数を生成するあるAPIを導入します、しかしそれはおおよそ半分は失敗します。

source: The following example models an asynchronous source of random numbers.
ja: 以下の例は、無作為数の非同期ソースをこしらえます。

source: The following example obtains an index advanced four positions from a string’s starting index and then prints the character at that position.
ja: 以下の例は、文字列の開始インデックスから４位置進んだインデックスを取得して、それからその位置の文字を出力します。

source: The following example obtains an index advanced four positions from an array’s starting index and then prints the element at that position.
ja: 以下の例は、配列の始まりから４位置進んだインデックスを入手して、それからその位置での要素を出力します。

source: The following example reverses the elements of an array of characters:
ja: 以下の例は、文字列からなる配列の要素を逆順にします：

source: The following example searches for the index of the number 40 in an array of integers, and then prints the suffix of the array starting at that index:
ja: 以下の例は、整数からなる配列において数40のインデックスを捜して、それからそのインデックスで始まる配列の末尾を出力します。

source: The following example searches for the index of the number 40 in an array of integers, and then prints the prefix of the array up to, and including, that index:
ja: 以下の例は、整数からなる配列において数40のインデックスを捜して、それからそのインデックスに至るまでの、そしてそれを含めて、配列の冒頭を出力します。

source: The following example searches for the index of the number 40 in an array of integers, and then prints the prefix of the array up to, but not including, that index:
ja: 以下の例は、整数からなる配列において数40のインデックスを捜して、それからそのインデックスに至るまでの、しかしそれを含めずに、配列の冒頭を出力します。

source: The following example shows how an array of strings can be joined to a single, comma-separated string:
ja: 以下の例は、どのように文字列からなる配列が単一の、コンマ区切りの文字列へと連結できるかを示します：

source: The following example shows how an iterator can be used explicitly to emulate a for-in loop.
ja: 次の例は、イテレータが明示的に使われてfor-inループの機能を真似る方法を示します。

source: The following example shows how you can determine free shipping options based on a customer’s purchase price:
ja: 以下の例は、どうやってあなたが顧客の購入品価格を基に無償出荷オプションを判定できるかを示します：

source: The following example transforms the error value of a result by wrapping it in a custom Error type:
ja: 以下の例は、ある結果のエラー値を、それをあるあつらえのError型の中のラップすることによって変換します：

source: The following example transforms the integer success value of a result into a string:
ja: 以下の例は、ある結果の整数成功値を文字列へ変換します：

source: The following example uses optional chaining to access the hasSuffix(_:) method on a String? instance.
ja: 以下の例は、オプショナル連鎖を使って、hasSuffix(_:)メソッドにString?インスタンス上でアクセスします。

source: The following example uses the drop(while:) method to skip over the positive numbers at the beginning of the numbers array.
ja: 以下の例は、drop(while:)メソッドを使って、正の数をnumbers配列の始まりで省きます。

source: The following example uses the first(where:) method to find the first negative number in an array of integers:
ja: 以下の例は、first(where:)メソッドを使って、整数の配列において最初の負数を見つけます：

source: The following example uses the negate() method to negate the value of an integer x:
ja: 以下の例はnegate()メソッドを使って、整数xの値を負にします：

source: The following example uses the prefix(while:) method to find the positive numbers at the beginning of the numbers array.
ja: 以下の例は、prefix(while:)メソッドを使って、正の数をnumbers配列の始まりで見つけます。

source: The following example uses the ~= operator to test whether an integer is included in a range of single-digit numbers:
ja: 以下の例は、~=演算子を使って、ある整数が一桁の数いくつかからなるある範囲に含まれるかどうか調べます：

source: The following example uses the init(catching:) initializer in the broader context of saving a series of calls for later statistical analysis:
ja: 以下の例は、init(catching:)イニシャライザを、後で統計学的に分析するために一連の呼び出しを保存する、より幅広い文脈において使います：

source: The following example uses the macro as a suffix to rename an enumeration:
ja: 以下の例は、マクロを接尾辞として使って列挙を改名します：

source: The following example uses this method to convert a partial range up to 4 into a half-open range, using an array instance to add the range’s lower bound.
ja: 以下の例は、このメソッドを使って、4までの不完全な範囲を半開範囲へと変換します、配列インスタンスを使って範囲の下側の境界を追加しています。

source: The following example uses this method to multiply two Int8 values that normally overflow when multiplied:
ja: 以下の例は、このメソッドを使って、通常は乗算した時オーバーフローする２つのInt8値を乗算します：

source: The following example uses this method to multiply two UInt8 values that normally overflow when multiplied:
ja: 以下の例は、このメソッドを使って、通常は乗算した時オーバーフローする２つのUInt8値を乗算します：

source: The following examples show the effects of the maxSplits and omittingEmptySubsequences parameters when splitting a string at each space character (” “).
ja: 以下の例は、maxSplitsとomittingEmptySubsequencesパラメータの効果を、各空白文字（” “）で文字列を分割する場合で示します。

source: The following examples show the effects of the maxSplits and omittingEmptySubsequences parameters when splitting a string using a closure that matches spaces.
ja: 以下の例は、maxSplitsとomittingEmptySubsequencesパラメータの効果を、空白にマッチするクロージャを使って文字列を分割する場合で示します。

source: The following examples use this dictionary of image names and file paths:
ja: 以降の例は、この画像名とファイルパスの辞書を使います：

source: The following rules determine how an API's existing interface is imported:
ja: 以下の規則は、APIの持つ既存のインターフェイスがインポートされる方法を決定します：

source: The fourth element of the vector.
ja: ベクターの４番目の要素。

source: The given argument without any changes.
ja: 何ら変更のない、与えられた引数。

source: The global abs(_:) function provides more familiar syntax when you need to find an absolute value.
ja: グローバルabs(_:)関数は、あなたが絶対値を見つける必要がある時により親しみやすい構文を提供します。

source: The greatest element in the vector.
ja: このベクターの中の最大の要素。

source: The greatest scalar in the vector.
ja: ベクターの中の最も大きいスカラー。

source: The hash value.
ja: ハッシュ値。

source: The hasher to use when combining the components of this instance.
ja: このインスタンスの構成要素を結合する場合に使うハーシャー。

source: The implementation of the new rgba property reuses the existing __getRed(red:green:blue:alpha:) method to ensure that functionality remains the same between Swift and Objective-C:
ja: 新しいrgbaプロパティの実装は、既存の__getRed(red:green:blue:alpha:)メソッドを再利用して、SwiftとObjective-Cの間で機能性が同じままであることを確かにします：

source: The increasing sequence of nonnegative integers used along with the bitwise left shift operator (<<) ensures that each option in the option set takes up a unique bit in the binary representation of the raw value.
ja: 非負整数からなるシーケンスの漸増、それだけでなくビット単位左シフト演算子（<<）は、オプションセットの中の各オプションが、生の値のバイナリ表現においてある特有なビットを取ることを確実にします。

source: The index at which to start the resulting subsequence.
ja: それで結果の下位シーケンスが始まるインデックス。

source: The index of member if it exists in the set; otherwise, nil.
ja: それがこの集合に含まれるならばmemberのインデックス；そうでなければ、nil。

source: The index of the element to access.
ja: アクセスする要素のインデックス。

source: The index of the first element for which predicate returns true.
ja: それに対してpredicateがtrueを返す最初の要素のインデックス。

source: The index of the first element in the reordered collection that matches belongsInSecondPartition.
ja: 並べ直されたコレクションの中の最初の要素のインデックス、それはbelongsInSecondPartitionに合致します。

source: The index of the first value to swap.
ja: 交換する１つ目の値のインデックス。

source: The index of the last element in the collection that matches predicate, or nil if no elements match.
ja: predicateに合致する、コレクションの中の最後の要素のインデックス、または合致する要素がないならばnil。

source: The index of the last element to include in the resulting subsequence.
ja: 結果の下位シーケンスの中に含まれることになる最後の要素のインデックス。

source: The index of the member to remove.
ja: 削除するメンバのインデックス。

source: The index of the second value to swap.
ja: 交換する２つ目の値のインデックス。

source: The index value immediately after i.
ja: iの直後のインデックス。

source: The index value immediately before i.
ja: iの直前のインデックス値。

source: The indices that are valid for subscripting the collection, in ascending order.
ja: コレクションの添え字に使うのに有効である、昇順でのインデックス。

source: The indices that are valid for subscripting the range, in ascending order.
ja: 昇順で、範囲の添え字として有効なインデックス。

source: The instance for which to create a mirror.
ja: それに対してミラーを作成するインスタンス。

source: The instance to represent in the new mirror.
ja: 新しいミラーの中で表現するインスタンス。

source: The instances of NSSet and Set share buffer using the same copy-on-write optimization that is used when two instances of Set share buffer.
ja: NSSetとSetのインスタンスは、Setの２つのインスタンスがバッファを共有するとき使われるのと、同じコピーオンライト最適化を使ってバッファを共有します。

source: The intersection of [member] and the set, if the intersection was nonempty; otherwise, nil.
ja: [member]とこの集合の交叉、その交叉が空でなかったならば；そうでなければ、nil。

source: The intersection of [newMember] and the set if the intersection was nonempty; otherwise, nil.
ja: [newMember]とこの集合の交叉、その交叉が空でなかったならば；そうでなければ、nil。

source: The iterator for a PartialRangeFrom instance.
ja: PartialRangeFromインスタンスに対するイテレータ。

source: The joined sequence of elements.
ja: つなぎ合わされたシーケンス要素。

source: The key that the decoded value is associated with.
ja: デコードされた値が関連付けられるキー。

source: The key that the nested container is associated with.
ja: 入れ子にされたコンテナが関連付けられるキー。

source: The key to associate the object with.
ja: オブジェクトと関連付けられるキー。

source: The key to associate the value with.
ja: 値と関連付けられるキー。

source: The key to decode super for.
ja: superをデコードするためのキー。

source: The key to encode super for.
ja: それに対してsuperをエンコードすることになるキー。

source: The key to encode the container for.
ja: それに対してコンテナをエンコードすることになるキー。

source: The key to search for.
ja: このキーについて調査します。

source: The key type to use for the container.
ja: コンテナに対して使うためのキー型。

source: The key-value pair at position position.
ja: 位置positionでのキー値ペア。

source: The kind of error this publisher might publish.
ja: このパブリッシャーが発行するかもしれないエラーの種類。

source: The kind of value published by this publisher.
ja: このパブリッシャーによって発行された値の種類。

source: The kind of values published by this publisher.
ja: このパブリッシャーによって発行される値の種類。

source: The labels of the resulting mirror’s children collection are all nil.
ja: 結果のミラーのもつchildrenコレクションのラベルは、すべてnilです。

source: The last element of the collection if the collection has one or more elements; otherwise, nil.
ja: コレクションが１つ以上の要素を持つならばコレクションの最後の要素；そうでなければnil。

source: The last element of the collection if the collection is not empty; otherwise, nil.
ja: コレクションが空でないならばコレクションの最後の要素；そうでなければnil。

source: The last element of the collection.
ja: コレクションの最後の要素。
